Revit 2027 API
CylindricalHelix.XVector Property
The X direction vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ XVector { get; }
Public ReadOnly Property XVector As XYZ
	Get
public:
property XYZ^ XVector {
	XYZ^ get ();
}
member XVector : XYZ with get
Property Value
XYZ
See Also
Reference
CylindricalHelix Class
Autodesk.Revit.DB Namespace